MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK11DX256AVLK5/mcu.h
#define B1RWSC[3:0]                   0x780000000      // Bank 1 Read Wait State Control
#define B1MW[1:0]                     0x000C0000      // Bank 1 Memory Width
#define B1DCE                         0x00000010      // Bank 1 Data Cache Enable
#define B1ICE                         0x00000008      // Bank 1 Instruction Cache Enable
#define B1DPE                         0x00000004      // Bank 1 Data Prefetch Enable
#define B1IPE                         0x00000002      // Bank 1 Instruction Prefetch Enable
#define B1SEBE                        0x00000001      // Bank 1 Single Entry Buffer Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW0Sn register.
//
//*****************************************************************************

#define tag[18:4]                     0x1FFFC0000      // 15-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW1Sn register.
//
//*****************************************************************************

#define tag[18:4]                     0x1FFFC0000      // 15-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW2Sn register.
//
//*****************************************************************************

#define tag[18:4]                     0x1FFFC0000      // 15-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW3Sn register.
//
//*****************************************************************************

#define tag[18:4]                     0x1FFFC0000      // 15-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnU register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnL register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnU register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnL register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnU register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnL register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnU register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnL register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry ::
#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the Flash Configuration Field Description register.
//
//*****************************************************************************

#define Backdoor Comparison Key       0x00007F80      // Backdoor Comparison Key
#define Program flash protection bytes0x00007800      // Program flash protection bytes
#define Program flash only devices: Reserved FlexNVM devices: Data flash protection byte0x00001000      // Program flash only devices: Reserved FlexNVM devices: Data flash protection byte
#define Program flash only devices: Reserved FlexNVM devices: EEPROM protection byte0x00002000      // Program flash only devices: Reserved FlexNVM devices: EEPROM protection byte
#define Flash nonvolatile option byte 0x00004000      // Flash nonvolatile option byte
#define Flash security byte           0x00008000      // Flash security byte


//*****************************************************************************
//
// The following are defines for the bit fields in the Program Flash IFR Map register.
//
//*****************************************************************************

#define Program Once Field            0x7FFFFFFFFFFFFFFF8000000000000000000000000000000000000000000000000000000000000000      // Program Once Field


//*****************************************************************************
//
// The following are defines for the bit fields in the Program Once Field register.
//
//*****************************************************************************

#define Program Once Field            0x7FFFFFFFFFFFFFFF8000000000000000      // Program Once Field


//*****************************************************************************
//
// The following are defines for the bit fields in the Data Flash IFR Map register.
//
//*****************************************************************************

