MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK11DX256AVLK5/mcu.h
#define HU                            0x7F80000000      // CRC High Upper Byte
#define HL                            0x7F800000      // CRC High Lower Byte
#define LU                            0x007F8000      // CRC Low Upper Byte
#define LL                            0x00007F80      // CRC Low Lower Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GPOLY register.
//
//*****************************************************************************

#define HIGH                          0x7FFF80000000      // High Polynominal Half-word
#define LOW                           0x7FFF8000      // Low Polynominal Half-word


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CTRL register.
//
//*****************************************************************************

#define TOT                           0x04000000      // Total bits in CRC polynomial
#define TOTR                          0x02000000      // Total bits in CRC remainder
#define FXOR                          0x01000000      // Final XOR value
#define WAS                           0x00800000      // Write seed or data
#define TCRC                          0x00400000      // Type of CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CASR register.
//
//*****************************************************************************

#define CAU Version                   0x780000000      // VER
#define DES Parity Error              0x00000002      // DPE
#define Illegal Command               0x00000001      // IC


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAA register.
//
//*****************************************************************************

#define Accumulator                   0x7FFFFFFF80000000      // ACC


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAn register.
//
//*****************************************************************************

#define General Purpose Registers     0x7FFFFFFF80000000      // CAn


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_SR register.
//
//*****************************************************************************

#define OREG_SIZE                     0x7F800000      // Output Register Size
#define OREG_LVL                      0x007F8000      // Output Register Level
#define SLP                           0x00000010      // Sleep
#define ERRI                          0x00000008      // Error Interrupt
#define ORU                           0x00000004      // Output Register Underflow
#define LRS                           0x00000002      // Last Read Status
#define SECV                          0x00000001      // Security Violation


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_ER register.
//
//*****************************************************************************

#define EXT_ENT                       0x7FFFFFFF80000000      // External Entropy


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_OR register.
//
//*****************************************************************************

#define RANDOUT                       0x7FFFFFFF80000000      // Random Output ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC1n register.
//
//*****************************************************************************

#define COCO                          0x00000080      // Conversion Complete Flag
#define AIEN                          0x00000040      // Interrupt Enable
#define DIFF                          0x00000020      // Differential Mode Enable
#define ADCH                          0x000001F0      // Input channel select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG1 register.
//
//*****************************************************************************

#define ADLPC                         0x00000080      // Low-Power Configuration
#define ADIV                          0x000000C0      // Clock Divide Select
#define ADLSMP                        0x00000010      // Sample Time Configuration
#define MODE                          0x00000018      // Conversion mode selection
#define ADICLK                        0x00000006      // Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG2 register.
//
//*****************************************************************************

#define MUXSEL                        0x00000010      // ADC Mux Select
#define ADACKEN                       0x00000008      // Asynchronous Clock Output Enable
#define ADHSC                         0x00000004      // High-Speed Configuration
#define ADLSTS                        0x00000006      // Long Sample Time Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_Rn register.
//
//*****************************************************************************

#define D                             0x7FFF8000      // Data result


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CVn register.
//
//*****************************************************************************

#define CV                            0x7FFF8000      // Compare Value


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC2 register.
//
//*****************************************************************************

#define ADACT                         0x00000080      // Conversion Active
#define ADTRG                         0x00000040      // Conversion Trigger Select
#define ACFE                          0x00000020      // Compare Function Enable
#define ACFGT                         0x00000010      // Compare Function Greater Than Enable
#define ACREN                         0x00000008      // Compare Function Range Enable
#define DMAEN                         0x00000004      // DMA Enable
#define REFSEL                        0x00000006      // Voltage Reference Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC3 register.
//
//*****************************************************************************

#define CAL                           0x00000080      // Calibration
#define CALF                          0x00000040      // Calibration Failed Flag
#define ADCO                          0x00000008      // Continuous Conversion Enable
#define AVGE                          0x00000004      // Hardware Average Enable
#define AVGS                          0x00000006      // Hardware Average Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_OFS register.
//
//*****************************************************************************

#define OFS                           0x7FFF8000      // Offset Error Correction Value


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_PG register.
//
//*****************************************************************************

#define PG                            0x7FFF8000      // Plus-Side Gain


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_MG register.
//
//*****************************************************************************

